AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo5a/regs/am_mcu_apollo5a_mraminfoc.h
// #### INTERNAL BEGIN ####
//
// Generated by infoGen.py/regMacro.py
//
// Block:       INFOC
// Chip:        Apollo5a
// Summary:     OTP Registers
// Description: This document details the contents of the Apollo5a One Time Programmable registers.
//
// #### INTERNAL END ####
//*****************************************************************************
//
//  am_mcu_apollo5a_infoc.h
//
//*****************************************************************************

//*****************************************************************************
//
// ${copyright}
//
// This is part of revision ${version} of the AmbiqSuite Development Package.
//
//*****************************************************************************

#ifndef AM_REG_INFOC_H
#define AM_REG_INFOC_H

//#define AM_REG_INFOC_BASEADDR 0x400C2000
#define AM_REG_INFOCn(n) 0x400C2000

#define AM_REG_INFOC_ROT0_O 0x00000044
#define AM_REG_INFOC_ROT0_ADDR 0x400c2044
#define AM_REG_INFOC_ROT1_O 0x00000048
#define AM_REG_INFOC_ROT1_ADDR 0x400c2048
#define AM_REG_INFOC_ROT2_O 0x0000004c
#define AM_REG_INFOC_ROT2_ADDR 0x400c204c
#define AM_REG_INFOC_ROT3_O 0x00000050
#define AM_REG_INFOC_ROT3_ADDR 0x400c2050
#define AM_REG_INFOC_ROT4_O 0x00000054
#define AM_REG_INFOC_ROT4_ADDR 0x400c2054
#define AM_REG_INFOC_ROT5_O 0x00000058
#define AM_REG_INFOC_ROT5_ADDR 0x400c2058
#define AM_REG_INFOC_ROT6_O 0x0000005c
#define AM_REG_INFOC_ROT6_ADDR 0x400c205c
#define AM_REG_INFOC_ROT7_O 0x00000060
#define AM_REG_INFOC_ROT7_ADDR 0x400c2060
#define AM_REG_INFOC_KCP0_O 0x00000064
#define AM_REG_INFOC_KCP0_ADDR 0x400c2064
#define AM_REG_INFOC_KCP1_O 0x00000068
#define AM_REG_INFOC_KCP1_ADDR 0x400c2068
#define AM_REG_INFOC_KCP2_O 0x0000006c
#define AM_REG_INFOC_KCP2_ADDR 0x400c206c
#define AM_REG_INFOC_KCP3_O 0x00000070
#define AM_REG_INFOC_KCP3_ADDR 0x400c2070
#define AM_REG_INFOC_KCE0_O 0x00000074
#define AM_REG_INFOC_KCE0_ADDR 0x400c2074
#define AM_REG_INFOC_KCE1_O 0x00000078
#define AM_REG_INFOC_KCE1_ADDR 0x400c2078
#define AM_REG_INFOC_KCE2_O 0x0000007c
#define AM_REG_INFOC_KCE2_ADDR 0x400c207c
#define AM_REG_INFOC_KCE3_O 0x00000080
#define AM_REG_INFOC_KCE3_ADDR 0x400c2080
#define AM_REG_INFOC_OEMPROGFLAGS_O 0x00000084
#define AM_REG_INFOC_OEMPROGFLAGS_ADDR 0x400c2084
#define AM_REG_INFOC_HBK1MINVER0_O 0x00000090
#define AM_REG_INFOC_HBK1MINVER0_ADDR 0x400c2090
#define AM_REG_INFOC_HBK1MINVER1_O 0x00000094
#define AM_REG_INFOC_HBK1MINVER1_ADDR 0x400c2094
#define AM_REG_INFOC_HBK1MINVER2_O 0x00000098
#define AM_REG_INFOC_HBK1MINVER2_ADDR 0x400c2098
#define AM_REG_INFOC_SECURITY_O 0x0000009c
#define AM_REG_INFOC_SECURITY_ADDR 0x400c209c
#define AM_REG_INFOC_LOCKMASK0_O 0x000000a0
#define AM_REG_INFOC_LOCKMASK0_ADDR 0x400c20a0
#define AM_REG_INFOC_LOCKMASK1_O 0x000000a4
#define AM_REG_INFOC_LOCKMASK1_ADDR 0x400c20a4
#define AM_REG_INFOC_LOCKMASK2_O 0x000000a8
#define AM_REG_INFOC_LOCKMASK2_ADDR 0x400c20a8
#define AM_REG_INFOC_LOCKMASK3_O 0x000000ac
#define AM_REG_INFOC_LOCKMASK3_ADDR 0x400c20ac
#define AM_REG_INFOC_SBL_WPROT0_O 0x00001800
#define AM_REG_INFOC_SBL_WPROT0_ADDR 0x400c3800
#define AM_REG_INFOC_SBL_WPROT1_O 0x00001804
#define AM_REG_INFOC_SBL_WPROT1_ADDR 0x400c3804
#define AM_REG_INFOC_SBL_WPROT2_O 0x00001808
#define AM_REG_INFOC_SBL_WPROT2_ADDR 0x400c3808
#define AM_REG_INFOC_SBL_WPROT3_O 0x0000180c
#define AM_REG_INFOC_SBL_WPROT3_ADDR 0x400c380c
#define AM_REG_INFOC_SBL_WPROT4_O 0x00001810
#define AM_REG_INFOC_SBL_WPROT4_ADDR 0x400c3810
#define AM_REG_INFOC_SBL_WPROT5_O 0x00001814
#define AM_REG_INFOC_SBL_WPROT5_ADDR 0x400c3814
#define AM_REG_INFOC_SBL_WPROT6_O 0x00001818
#define AM_REG_INFOC_SBL_WPROT6_ADDR 0x400c3818
#define AM_REG_INFOC_SBL_WPROT7_O 0x0000181c
#define AM_REG_INFOC_SBL_WPROT7_ADDR 0x400c381c
#define AM_REG_INFOC_SBL_RPROT0_O 0x00001820
#define AM_REG_INFOC_SBL_RPROT0_ADDR 0x400c3820
#define AM_REG_INFOC_SBL_RPROT1_O 0x00001824
#define AM_REG_INFOC_SBL_RPROT1_ADDR 0x400c3824
#define AM_REG_INFOC_SBL_RPROT2_O 0x00001828
#define AM_REG_INFOC_SBL_RPROT2_ADDR 0x400c3828
#define AM_REG_INFOC_SBL_RPROT3_O 0x0000182c
#define AM_REG_INFOC_SBL_RPROT3_ADDR 0x400c382c
#define AM_REG_INFOC_SBL_RPROT4_O 0x00001830
#define AM_REG_INFOC_SBL_RPROT4_ADDR 0x400c3830
#define AM_REG_INFOC_SBL_RPROT5_O 0x00001834
#define AM_REG_INFOC_SBL_RPROT5_ADDR 0x400c3834
#define AM_REG_INFOC_SBL_RPROT6_O 0x00001838
#define AM_REG_INFOC_SBL_RPROT6_ADDR 0x400c3838
#define AM_REG_INFOC_SBL_RPROT7_O 0x0000183c
#define AM_REG_INFOC_SBL_RPROT7_ADDR 0x400c383c
#define AM_REG_INFOC_DCU_DISABLEOVERRIDE_O 0x00001840
#define AM_REG_INFOC_DCU_DISABLEOVERRIDE_ADDR 0x400c3840
#define AM_REG_INFOC_SEC_POL_O 0x0000184c
#define AM_REG_INFOC_SEC_POL_ADDR 0x400c384c
#define AM_REG_INFOC_BOOT_OVERRIDE_O 0x00001850
#define AM_REG_INFOC_BOOT_OVERRIDE_ADDR 0x400c3850
#define AM_REG_INFOC_WIRED_CONFIG_O 0x00001854
#define AM_REG_INFOC_WIRED_CONFIG_ADDR 0x400c3854
#define AM_REG_INFOC_CUST_WPROT0_O 0x00001858
#define AM_REG_INFOC_CUST_WPROT0_ADDR 0x400c3858
#define AM_REG_INFOC_CUST_WPROT1_O 0x0000185c
#define AM_REG_INFOC_CUST_WPROT1_ADDR 0x400c385c
#define AM_REG_INFOC_CUST_WPROT2_O 0x00001860
#define AM_REG_INFOC_CUST_WPROT2_ADDR 0x400c3860
#define AM_REG_INFOC_CUST_WPROT3_O 0x00001864
#define AM_REG_INFOC_CUST_WPROT3_ADDR 0x400c3864
#define AM_REG_INFOC_CUST_WPROT4_O 0x00001868
#define AM_REG_INFOC_CUST_WPROT4_ADDR 0x400c3868
#define AM_REG_INFOC_CUST_WPROT5_O 0x0000186c
#define AM_REG_INFOC_CUST_WPROT5_ADDR 0x400c386c
#define AM_REG_INFOC_CUST_WPROT6_O 0x00001870
#define AM_REG_INFOC_CUST_WPROT6_ADDR 0x400c3870
#define AM_REG_INFOC_CUST_WPROT7_O 0x00001874
#define AM_REG_INFOC_CUST_WPROT7_ADDR 0x400c3874
#define AM_REG_INFOC_CUSTOTP_PROGLOCK_O 0x00001878
#define AM_REG_INFOC_CUSTOTP_PROGLOCK_ADDR 0x400c3878
#define AM_REG_INFOC_CUSTOTP_RDLOCK_O 0x0000187c
#define AM_REG_INFOC_CUSTOTP_RDLOCK_ADDR 0x400c387c
#define AM_REG_INFOC_CUSTOTP_READ_KEY0_O 0x00001a00
#define AM_REG_INFOC_CUSTOTP_READ_KEY0_ADDR 0x400c3a00
#define AM_REG_INFOC_CUSTOTP_READ_KEY1_O 0x00001a04
#define AM_REG_INFOC_CUSTOTP_READ_KEY1_ADDR 0x400c3a04
#define AM_REG_INFOC_CUSTOTP_READ_KEY2_O 0x00001a08
#define AM_REG_INFOC_CUSTOTP_READ_KEY2_ADDR 0x400c3a08
#define AM_REG_INFOC_CUSTOTP_READ_KEY3_O 0x00001a0c
#define AM_REG_INFOC_CUSTOTP_READ_KEY3_ADDR 0x400c3a0c
#define AM_REG_INFOC_CUSTOTP_PROG_KEY0_O 0x00001a10
#define AM_REG_INFOC_CUSTOTP_PROG_KEY0_ADDR 0x400c3a10
#define AM_REG_INFOC_CUSTOTP_PROG_KEY1_O 0x00001a14
#define AM_REG_INFOC_CUSTOTP_PROG_KEY1_ADDR 0x400c3a14
#define AM_REG_INFOC_CUSTOTP_PROG_KEY2_O 0x00001a18
#define AM_REG_INFOC_CUSTOTP_PROG_KEY2_ADDR 0x400c3a18
#define AM_REG_INFOC_CUSTOTP_PROG_KEY3_O 0x00001a1c
#define AM_REG_INFOC_CUSTOTP_PROG_KEY3_ADDR 0x400c3a1c
#define AM_REG_INFOC_CUST_RPROT0_O 0x00001a20
#define AM_REG_INFOC_CUST_RPROT0_ADDR 0x400c3a20
#define AM_REG_INFOC_CUST_RPROT1_O 0x00001a24
#define AM_REG_INFOC_CUST_RPROT1_ADDR 0x400c3a24
#define AM_REG_INFOC_CUST_RPROT2_O 0x00001a28
#define AM_REG_INFOC_CUST_RPROT2_ADDR 0x400c3a28
#define AM_REG_INFOC_CUST_RPROT3_O 0x00001a2c
#define AM_REG_INFOC_CUST_RPROT3_ADDR 0x400c3a2c
#define AM_REG_INFOC_CUST_RPROT4_O 0x00001a30
#define AM_REG_INFOC_CUST_RPROT4_ADDR 0x400c3a30
#define AM_REG_INFOC_CUST_RPROT5_O 0x00001a34
#define AM_REG_INFOC_CUST_RPROT5_ADDR 0x400c3a34
#define AM_REG_INFOC_CUST_RPROT6_O 0x00001a38
#define AM_REG_INFOC_CUST_RPROT6_ADDR 0x400c3a38
#define AM_REG_INFOC_CUST_RPROT7_O 0x00001a3c
#define AM_REG_INFOC_CUST_RPROT7_ADDR 0x400c3a3c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY0_O 0x00001c00
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY0_ADDR 0x400c3c00
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY1_O 0x00001c04
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY1_ADDR 0x400c3c04
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY2_O 0x00001c08
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY2_ADDR 0x400c3c08
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY3_O 0x00001c0c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY3_ADDR 0x400c3c0c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY4_O 0x00001c10
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY4_ADDR 0x400c3c10
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY5_O 0x00001c14
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY5_ADDR 0x400c3c14
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY6_O 0x00001c18
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY6_ADDR 0x400c3c18
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY7_O 0x00001c1c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY7_ADDR 0x400c3c1c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY8_O 0x00001c20
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY8_ADDR 0x400c3c20
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY9_O 0x00001c24
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY9_ADDR 0x400c3c24
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY10_O 0x00001c28
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY10_ADDR 0x400c3c28
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY11_O 0x00001c2c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY11_ADDR 0x400c3c2c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY12_O 0x00001c30
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY12_ADDR 0x400c3c30
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY13_O 0x00001c34
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY13_ADDR 0x400c3c34
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY14_O 0x00001c38
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY14_ADDR 0x400c3c38
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY15_O 0x00001c3c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT0_KEY15_ADDR 0x400c3c3c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY0_O 0x00001d00
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY0_ADDR 0x400c3d00
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY1_O 0x00001d04
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY1_ADDR 0x400c3d04
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY2_O 0x00001d08
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY2_ADDR 0x400c3d08
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY3_O 0x00001d0c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY3_ADDR 0x400c3d0c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY4_O 0x00001d10
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY4_ADDR 0x400c3d10
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY5_O 0x00001d14
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY5_ADDR 0x400c3d14
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY6_O 0x00001d18
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY6_ADDR 0x400c3d18
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY7_O 0x00001d1c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY7_ADDR 0x400c3d1c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY8_O 0x00001d20
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY8_ADDR 0x400c3d20
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY9_O 0x00001d24
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY9_ADDR 0x400c3d24
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY10_O 0x00001d28
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY10_ADDR 0x400c3d28
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY11_O 0x00001d2c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY11_ADDR 0x400c3d2c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY12_O 0x00001d30
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY12_ADDR 0x400c3d30
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY13_O 0x00001d34
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY13_ADDR 0x400c3d34
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY14_O 0x00001d38
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY14_ADDR 0x400c3d38
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY15_O 0x00001d3c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT1_KEY15_ADDR 0x400c3d3c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY0_O 0x00001e00
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY0_ADDR 0x400c3e00
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY1_O 0x00001e04
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY1_ADDR 0x400c3e04
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY2_O 0x00001e08
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY2_ADDR 0x400c3e08
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY3_O 0x00001e0c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY3_ADDR 0x400c3e0c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY4_O 0x00001e10
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY4_ADDR 0x400c3e10
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY5_O 0x00001e14
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY5_ADDR 0x400c3e14
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY6_O 0x00001e18
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY6_ADDR 0x400c3e18
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY7_O 0x00001e1c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY7_ADDR 0x400c3e1c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY8_O 0x00001e20
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY8_ADDR 0x400c3e20
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY9_O 0x00001e24
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY9_ADDR 0x400c3e24
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY10_O 0x00001e28
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY10_ADDR 0x400c3e28
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY11_O 0x00001e2c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY11_ADDR 0x400c3e2c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY12_O 0x00001e30
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY12_ADDR 0x400c3e30
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY13_O 0x00001e34
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY13_ADDR 0x400c3e34
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY14_O 0x00001e38
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY14_ADDR 0x400c3e38
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY15_O 0x00001e3c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT2_KEY15_ADDR 0x400c3e3c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY0_O 0x00001f00
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY0_ADDR 0x400c3f00
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY1_O 0x00001f04
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY1_ADDR 0x400c3f04
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY2_O 0x00001f08
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY2_ADDR 0x400c3f08
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY3_O 0x00001f0c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY3_ADDR 0x400c3f0c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY4_O 0x00001f10
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY4_ADDR 0x400c3f10
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY5_O 0x00001f14
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY5_ADDR 0x400c3f14
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY6_O 0x00001f18
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY6_ADDR 0x400c3f18
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY7_O 0x00001f1c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY7_ADDR 0x400c3f1c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY8_O 0x00001f20
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY8_ADDR 0x400c3f20
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY9_O 0x00001f24
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY9_ADDR 0x400c3f24
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY10_O 0x00001f28
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY10_ADDR 0x400c3f28
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY11_O 0x00001f2c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY11_ADDR 0x400c3f2c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY12_O 0x00001f30
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY12_ADDR 0x400c3f30
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY13_O 0x00001f34
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY13_ADDR 0x400c3f34
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY14_O 0x00001f38
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY14_ADDR 0x400c3f38
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY15_O 0x00001f3c
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY15_ADDR 0x400c3f3c

// ROT0 - Word 0 (bits 31:0) of the 256-bit ROT
#define AM_REG_INFOC_ROT0_ROT0_S 0
#define AM_REG_INFOC_ROT0_ROT0_M 0xFFFFFFFF
#define AM_REG_INFOC_ROT0_ROT0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_ROT0_ROT0_Pos 0
#define AM_REG_INFOC_ROT0_ROT0_Msk 0xFFFFFFFF

// ROT1 - Word 1 (bits 63:32) of the 256-bit ROT
#define AM_REG_INFOC_ROT1_ROT1_S 0
#define AM_REG_INFOC_ROT1_ROT1_M 0xFFFFFFFF
#define AM_REG_INFOC_ROT1_ROT1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_ROT1_ROT1_Pos 0
#define AM_REG_INFOC_ROT1_ROT1_Msk 0xFFFFFFFF

// ROT2 - Word 2 (bits 95:64) of the 256-bit ROT
#define AM_REG_INFOC_ROT2_ROT2_S 0
#define AM_REG_INFOC_ROT2_ROT2_M 0xFFFFFFFF
#define AM_REG_INFOC_ROT2_ROT2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_ROT2_ROT2_Pos 0
#define AM_REG_INFOC_ROT2_ROT2_Msk 0xFFFFFFFF

// ROT3 - Word 3 (bits 127:96) of the 256-bit ROT
#define AM_REG_INFOC_ROT3_ROT3_S 0
#define AM_REG_INFOC_ROT3_ROT3_M 0xFFFFFFFF
#define AM_REG_INFOC_ROT3_ROT3(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_ROT3_ROT3_Pos 0
#define AM_REG_INFOC_ROT3_ROT3_Msk 0xFFFFFFFF

// ROT4 - Word 4 (bits 159:128) of the 256-bit ROT
#define AM_REG_INFOC_ROT4_ROT4_S 0
#define AM_REG_INFOC_ROT4_ROT4_M 0xFFFFFFFF
#define AM_REG_INFOC_ROT4_ROT4(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_ROT4_ROT4_Pos 0
#define AM_REG_INFOC_ROT4_ROT4_Msk 0xFFFFFFFF

// ROT5 - Word 5 (bits 191:160) of the 256-bit ROT
#define AM_REG_INFOC_ROT5_ROT5_S 0
#define AM_REG_INFOC_ROT5_ROT5_M 0xFFFFFFFF
#define AM_REG_INFOC_ROT5_ROT5(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_ROT5_ROT5_Pos 0
#define AM_REG_INFOC_ROT5_ROT5_Msk 0xFFFFFFFF

// ROT6 - Word 6 (bits 223:192) of the 256-bit ROT
#define AM_REG_INFOC_ROT6_ROT6_S 0
#define AM_REG_INFOC_ROT6_ROT6_M 0xFFFFFFFF
#define AM_REG_INFOC_ROT6_ROT6(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_ROT6_ROT6_Pos 0
#define AM_REG_INFOC_ROT6_ROT6_Msk 0xFFFFFFFF

// ROT7 - Word 7 (bits 255:224) of the 256-bit ROT
#define AM_REG_INFOC_ROT7_ROT7_S 0
#define AM_REG_INFOC_ROT7_ROT7_M 0xFFFFFFFF
#define AM_REG_INFOC_ROT7_ROT7(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_ROT7_ROT7_Pos 0
#define AM_REG_INFOC_ROT7_ROT7_Msk 0xFFFFFFFF

// KCP0 - Word 0 (bits 32:0) of the 128-bit KCP
#define AM_REG_INFOC_KCP0_KCP0_S 0
#define AM_REG_INFOC_KCP0_KCP0_M 0xFFFFFFFF
#define AM_REG_INFOC_KCP0_KCP0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KCP0_KCP0_Pos 0
#define AM_REG_INFOC_KCP0_KCP0_Msk 0xFFFFFFFF

// KCP1 - Word 1 (bits 63:32) of the 128-bit KCP
#define AM_REG_INFOC_KCP1_KCP1_S 0
#define AM_REG_INFOC_KCP1_KCP1_M 0xFFFFFFFF
#define AM_REG_INFOC_KCP1_KCP1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KCP1_KCP1_Pos 0
#define AM_REG_INFOC_KCP1_KCP1_Msk 0xFFFFFFFF

