AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo5a/regs/am_mcu_apollo5a_mraminfoc.h
// KCP2 - Word 2 (bits 95:64) of the 128-bit KCP
#define AM_REG_INFOC_KCP2_KCP2_S 0
#define AM_REG_INFOC_KCP2_KCP2_M 0xFFFFFFFF
#define AM_REG_INFOC_KCP2_KCP2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KCP2_KCP2_Pos 0
#define AM_REG_INFOC_KCP2_KCP2_Msk 0xFFFFFFFF

// KCP3 - Word 3 (bits 127:96) of the 128-bit KCP
#define AM_REG_INFOC_KCP3_KCP3_S 0
#define AM_REG_INFOC_KCP3_KCP3_M 0xFFFFFFFF
#define AM_REG_INFOC_KCP3_KCP3(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KCP3_KCP3_Pos 0
#define AM_REG_INFOC_KCP3_KCP3_Msk 0xFFFFFFFF

// KCE0 - Word 0 (bits 32:0) of the 128-bit KCE
#define AM_REG_INFOC_KCE0_KCE0_S 0
#define AM_REG_INFOC_KCE0_KCE0_M 0xFFFFFFFF
#define AM_REG_INFOC_KCE0_KCE0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KCE0_KCE0_Pos 0
#define AM_REG_INFOC_KCE0_KCE0_Msk 0xFFFFFFFF

// KCE1 - Word 1 (bits 63:32) of the 128-bit KCE
#define AM_REG_INFOC_KCE1_KCE1_S 0
#define AM_REG_INFOC_KCE1_KCE1_M 0xFFFFFFFF
#define AM_REG_INFOC_KCE1_KCE1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KCE1_KCE1_Pos 0
#define AM_REG_INFOC_KCE1_KCE1_Msk 0xFFFFFFFF

// KCE2 - Word 2 (bits 95:64) of the 128-bit KCE
#define AM_REG_INFOC_KCE2_KCE2_S 0
#define AM_REG_INFOC_KCE2_KCE2_M 0xFFFFFFFF
#define AM_REG_INFOC_KCE2_KCE2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KCE2_KCE2_Pos 0
#define AM_REG_INFOC_KCE2_KCE2_Msk 0xFFFFFFFF

// KCE3 - Word 3 (bits 127:96) of the 128-bit KCE
#define AM_REG_INFOC_KCE3_KCE3_S 0
#define AM_REG_INFOC_KCE3_KCE3_M 0xFFFFFFFF
#define AM_REG_INFOC_KCE3_KCE3(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KCE3_KCE3_Pos 0
#define AM_REG_INFOC_KCE3_KCE3_Msk 0xFFFFFFFF

// OEMPROGFLAGS - OEM Programmed Flags
#define AM_REG_INFOC_OEMPROGFLAGS_ICVRMAFLAG_S 31
#define AM_REG_INFOC_OEMPROGFLAGS_ICVRMAFLAG_M 0x80000000
#define AM_REG_INFOC_OEMPROGFLAGS_ICVRMAFLAG(n) (((uint32_t)(n) << 31) & 0x80000000)
#define AM_REG_INFOC_OEMPROGFLAGS_ICVRMAFLAG_Pos 31
#define AM_REG_INFOC_OEMPROGFLAGS_ICVRMAFLAG_Msk 0x80000000
#define AM_REG_INFOC_OEMPROGFLAGS_OEMRMAFLAG_S 30
#define AM_REG_INFOC_OEMPROGFLAGS_OEMRMAFLAG_M 0x40000000
#define AM_REG_INFOC_OEMPROGFLAGS_OEMRMAFLAG(n) (((uint32_t)(n) << 30) & 0x40000000)
#define AM_REG_INFOC_OEMPROGFLAGS_OEMRMAFLAG_Pos 30
#define AM_REG_INFOC_OEMPROGFLAGS_OEMRMAFLAG_Msk 0x40000000
#define AM_REG_INFOC_OEMPROGFLAGS_RESERVED_S 24
#define AM_REG_INFOC_OEMPROGFLAGS_RESERVED_M 0x3F000000
#define AM_REG_INFOC_OEMPROGFLAGS_RESERVED(n) (((uint32_t)(n) << 24) & 0x3F000000)
#define AM_REG_INFOC_OEMPROGFLAGS_RESERVED_Pos 24
#define AM_REG_INFOC_OEMPROGFLAGS_RESERVED_Msk 0x3F000000
#define AM_REG_INFOC_OEMPROGFLAGS_KCENOTINUSE_S 23
#define AM_REG_INFOC_OEMPROGFLAGS_KCENOTINUSE_M 0x00800000
#define AM_REG_INFOC_OEMPROGFLAGS_KCENOTINUSE(n) (((uint32_t)(n) << 23) & 0x00800000)
#define AM_REG_INFOC_OEMPROGFLAGS_KCENOTINUSE_Pos 23
#define AM_REG_INFOC_OEMPROGFLAGS_KCENOTINUSE_Msk 0x00800000
#define AM_REG_INFOC_OEMPROGFLAGS_NUMZEROKCE_S 16
#define AM_REG_INFOC_OEMPROGFLAGS_NUMZEROKCE_M 0x007F0000
#define AM_REG_INFOC_OEMPROGFLAGS_NUMZEROKCE(n) (((uint32_t)(n) << 16) & 0x007F0000)
#define AM_REG_INFOC_OEMPROGFLAGS_NUMZEROKCE_Pos 16
#define AM_REG_INFOC_OEMPROGFLAGS_NUMZEROKCE_Msk 0x007F0000
#define AM_REG_INFOC_OEMPROGFLAGS_KCPNOTINUSE_S 15
#define AM_REG_INFOC_OEMPROGFLAGS_KCPNOTINUSE_M 0x00008000
#define AM_REG_INFOC_OEMPROGFLAGS_KCPNOTINUSE(n) (((uint32_t)(n) << 15) & 0x00008000)
#define AM_REG_INFOC_OEMPROGFLAGS_KCPNOTINUSE_Pos 15
#define AM_REG_INFOC_OEMPROGFLAGS_KCPNOTINUSE_Msk 0x00008000
#define AM_REG_INFOC_OEMPROGFLAGS_NUMZEROKCP_S 8
#define AM_REG_INFOC_OEMPROGFLAGS_NUMZEROKCP_M 0x00007F00
#define AM_REG_INFOC_OEMPROGFLAGS_NUMZEROKCP(n) (((uint32_t)(n) << 8) & 0x00007F00)
#define AM_REG_INFOC_OEMPROGFLAGS_NUMZEROKCP_Pos 8
#define AM_REG_INFOC_OEMPROGFLAGS_NUMZEROKCP_Msk 0x00007F00
#define AM_REG_INFOC_OEMPROGFLAGS_NUMZEROHBK1_S 0
#define AM_REG_INFOC_OEMPROGFLAGS_NUMZEROHBK1_M 0x000000FF
#define AM_REG_INFOC_OEMPROGFLAGS_NUMZEROHBK1(n) (((uint32_t)(n) << 0) & 0x000000FF)
#define AM_REG_INFOC_OEMPROGFLAGS_NUMZEROHBK1_Pos 0
#define AM_REG_INFOC_OEMPROGFLAGS_NUMZEROHBK1_Msk 0x000000FF

// HBK1MINVER0 - HBK1 Trusted Software minimum version (anti-rollback counter)
#define AM_REG_INFOC_HBK1MINVER0_HBK1MINVER0_S 0
#define AM_REG_INFOC_HBK1MINVER0_HBK1MINVER0_M 0xFFFFFFFF
#define AM_REG_INFOC_HBK1MINVER0_HBK1MINVER0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_HBK1MINVER0_HBK1MINVER0_Pos 0
#define AM_REG_INFOC_HBK1MINVER0_HBK1MINVER0_Msk 0xFFFFFFFF

// HBK1MINVER1 - HBK1 Trusted Software minimum version (anti-rollback counter)
#define AM_REG_INFOC_HBK1MINVER1_HBK1MINVER1_S 0
#define AM_REG_INFOC_HBK1MINVER1_HBK1MINVER1_M 0xFFFFFFFF
#define AM_REG_INFOC_HBK1MINVER1_HBK1MINVER1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_HBK1MINVER1_HBK1MINVER1_Pos 0
#define AM_REG_INFOC_HBK1MINVER1_HBK1MINVER1_Msk 0xFFFFFFFF

// HBK1MINVER2 - HBK1 Trusted Software minimum version (anti-rollback counter)
#define AM_REG_INFOC_HBK1MINVER2_HBK1MINVER2_S 0
#define AM_REG_INFOC_HBK1MINVER2_HBK1MINVER2_M 0xFFFFFFFF
#define AM_REG_INFOC_HBK1MINVER2_HBK1MINVER2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_HBK1MINVER2_HBK1MINVER2_Pos 0
#define AM_REG_INFOC_HBK1MINVER2_HBK1MINVER2_Msk 0xFFFFFFFF

// SECURITY - General purpose persistent configuration
#define AM_REG_INFOC_SECURITY_RSVD31_S 31
#define AM_REG_INFOC_SECURITY_RSVD31_M 0x80000000
#define AM_REG_INFOC_SECURITY_RSVD31(n) (((uint32_t)(n) << 31) & 0x80000000)
#define AM_REG_INFOC_SECURITY_RSVD31_Pos 31
#define AM_REG_INFOC_SECURITY_RSVD31_Msk 0x80000000
#define AM_REG_INFOC_SECURITY_CUST_SECBOOTONRST_S 28
#define AM_REG_INFOC_SECURITY_CUST_SECBOOTONRST_M 0x70000000
#define AM_REG_INFOC_SECURITY_CUST_SECBOOTONRST(n) (((uint32_t)(n) << 28) & 0x70000000)
#define AM_REG_INFOC_SECURITY_CUST_SECBOOTONRST_Pos 28
#define AM_REG_INFOC_SECURITY_CUST_SECBOOTONRST_Msk 0x70000000
#define AM_ENUM_INFOC_SECURITY_CUST_SECBOOTONRST_SBOREN         0x2  // Secure boot on reset enable
#define AM_ENUM_INFOC_SECURITY_CUST_SECBOOTONRST_SBORDIS        0x5  // Secure boot on reset disabled. Only specific portions of secure boot flow are bypassed to allow for lower latency resume.
#define AM_REG_INFOC_SECURITY_RSVD27_S 27
#define AM_REG_INFOC_SECURITY_RSVD27_M 0x08000000
#define AM_REG_INFOC_SECURITY_RSVD27(n) (((uint32_t)(n) << 27) & 0x08000000)
#define AM_REG_INFOC_SECURITY_RSVD27_Pos 27
#define AM_REG_INFOC_SECURITY_RSVD27_Msk 0x08000000
#define AM_REG_INFOC_SECURITY_AMB_SECBOOT_S 24
#define AM_REG_INFOC_SECURITY_AMB_SECBOOT_M 0x07000000
#define AM_REG_INFOC_SECURITY_AMB_SECBOOT(n) (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_INFOC_SECURITY_AMB_SECBOOT_Pos 24
#define AM_REG_INFOC_SECURITY_AMB_SECBOOT_Msk 0x07000000
#define AM_ENUM_INFOC_SECURITY_AMB_SECBOOT_SBEN                 0x2  // Secure boot enable
#define AM_ENUM_INFOC_SECURITY_AMB_SECBOOT_SBDIS                0x5  // Secure boot disabled
#define AM_REG_INFOC_SECURITY_RSVD23_S 23
#define AM_REG_INFOC_SECURITY_RSVD23_M 0x00800000
#define AM_REG_INFOC_SECURITY_RSVD23(n) (((uint32_t)(n) << 23) & 0x00800000)
#define AM_REG_INFOC_SECURITY_RSVD23_Pos 23
#define AM_REG_INFOC_SECURITY_RSVD23_Msk 0x00800000
#define AM_REG_INFOC_SECURITY_AMB_SECBOOT_INST_S 20
#define AM_REG_INFOC_SECURITY_AMB_SECBOOT_INST_M 0x00700000
#define AM_REG_INFOC_SECURITY_AMB_SECBOOT_INST(n) (((uint32_t)(n) << 20) & 0x00700000)
#define AM_REG_INFOC_SECURITY_AMB_SECBOOT_INST_Pos 20
#define AM_REG_INFOC_SECURITY_AMB_SECBOOT_INST_Msk 0x00700000
#define AM_ENUM_INFOC_SECURITY_AMB_SECBOOT_INST_SBEN            0x2  // Secure boot enable
#define AM_ENUM_INFOC_SECURITY_AMB_SECBOOT_INST_SBDIS           0x5  // Secure boot disabled
#define AM_REG_INFOC_SECURITY_NVM_WIPE_S 19
#define AM_REG_INFOC_SECURITY_NVM_WIPE_M 0x00080000
#define AM_REG_INFOC_SECURITY_NVM_WIPE(n) (((uint32_t)(n) << 19) & 0x00080000)
#define AM_REG_INFOC_SECURITY_NVM_WIPE_Pos 19
#define AM_REG_INFOC_SECURITY_NVM_WIPE_Msk 0x00080000
#define AM_REG_INFOC_SECURITY_SRAM_WIPE_S 18
#define AM_REG_INFOC_SECURITY_SRAM_WIPE_M 0x00040000
#define AM_REG_INFOC_SECURITY_SRAM_WIPE(n) (((uint32_t)(n) << 18) & 0x00040000)
#define AM_REG_INFOC_SECURITY_SRAM_WIPE_Pos 18
#define AM_REG_INFOC_SECURITY_SRAM_WIPE_Msk 0x00040000
#define AM_REG_INFOC_SECURITY_AMB_SECURE_LOCK_S 17
#define AM_REG_INFOC_SECURITY_AMB_SECURE_LOCK_M 0x00020000
#define AM_REG_INFOC_SECURITY_AMB_SECURE_LOCK(n) (((uint32_t)(n) << 17) & 0x00020000)
#define AM_REG_INFOC_SECURITY_AMB_SECURE_LOCK_Pos 17
#define AM_REG_INFOC_SECURITY_AMB_SECURE_LOCK_Msk 0x00020000
#define AM_REG_INFOC_SECURITY_CUST_SECURE_LOCK_S 16
#define AM_REG_INFOC_SECURITY_CUST_SECURE_LOCK_M 0x00010000
#define AM_REG_INFOC_SECURITY_CUST_SECURE_LOCK(n) (((uint32_t)(n) << 16) & 0x00010000)
#define AM_REG_INFOC_SECURITY_CUST_SECURE_LOCK_Pos 16
#define AM_REG_INFOC_SECURITY_CUST_SECURE_LOCK_Msk 0x00010000
#define AM_REG_INFOC_SECURITY_DIS_CUST_INFO_PROG_S 12
#define AM_REG_INFOC_SECURITY_DIS_CUST_INFO_PROG_M 0x0000F000
#define AM_REG_INFOC_SECURITY_DIS_CUST_INFO_PROG(n) (((uint32_t)(n) << 12) & 0x0000F000)
#define AM_REG_INFOC_SECURITY_DIS_CUST_INFO_PROG_Pos 12
#define AM_REG_INFOC_SECURITY_DIS_CUST_INFO_PROG_Msk 0x0000F000
#define AM_REG_INFOC_SECURITY_PLONEXIT_S 11
#define AM_REG_INFOC_SECURITY_PLONEXIT_M 0x00000800
#define AM_REG_INFOC_SECURITY_PLONEXIT(n) (((uint32_t)(n) << 11) & 0x00000800)
#define AM_REG_INFOC_SECURITY_PLONEXIT_Pos 11
#define AM_REG_INFOC_SECURITY_PLONEXIT_Msk 0x00000800
#define AM_ENUM_INFOC_SECURITY_PLONEXIT_PLNS                    0x1  // PROTLOCK No Secondary bootloader.  No secondary bootloader is provided, thus the Secure Bootloader (SBL) asserts PROTLOCK for protection of NVM and OTP keybank.
#define AM_ENUM_INFOC_SECURITY_PLONEXIT_PLS                     0x0  // PROTLOCK by Secondary bootloader. The Secure Bootloader (SBL) keeps PROTLOCK open for the secondary bootloader. It is the responsibility of the secondary bootloader to assert PROTLOCK upon exit.
#define AM_REG_INFOC_SECURITY_CUST_SECBOOT_S 8
#define AM_REG_INFOC_SECURITY_CUST_SECBOOT_M 0x00000700
#define AM_REG_INFOC_SECURITY_CUST_SECBOOT(n) (((uint32_t)(n) << 8) & 0x00000700)
#define AM_REG_INFOC_SECURITY_CUST_SECBOOT_Pos 8
#define AM_REG_INFOC_SECURITY_CUST_SECBOOT_Msk 0x00000700
#define AM_ENUM_INFOC_SECURITY_CUST_SECBOOT_SBEN                0x2  // Secure boot enable
#define AM_ENUM_INFOC_SECURITY_CUST_SECBOOT_SBDIS               0x5  // Secure boot disabled
#define AM_REG_INFOC_SECURITY_AMB_CRYPTO_PUBLOCK_S 5
#define AM_REG_INFOC_SECURITY_AMB_CRYPTO_PUBLOCK_M 0x000000E0
#define AM_REG_INFOC_SECURITY_AMB_CRYPTO_PUBLOCK(n) (((uint32_t)(n) << 5) & 0x000000E0)
#define AM_REG_INFOC_SECURITY_AMB_CRYPTO_PUBLOCK_Pos 5
#define AM_REG_INFOC_SECURITY_AMB_CRYPTO_PUBLOCK_Msk 0x000000E0
#define AM_ENUM_INFOC_SECURITY_AMB_CRYPTO_PUBLOCK_Disabled      0x5  // No decryption.
#define AM_REG_INFOC_SECURITY_RSVD_GPPC_S 0
#define AM_REG_INFOC_SECURITY_RSVD_GPPC_M 0x0000001F
#define AM_REG_INFOC_SECURITY_RSVD_GPPC(n) (((uint32_t)(n) << 0) & 0x0000001F)
#define AM_REG_INFOC_SECURITY_RSVD_GPPC_Pos 0
#define AM_REG_INFOC_SECURITY_RSVD_GPPC_Msk 0x0000001F

