AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo5a/regs/am_mcu_apollo5a_mraminfoc.h
// LOCKMASK0 - OTP DCU lock mask
#define AM_REG_INFOC_LOCKMASK0_OTP_DCU_LOCK_MASK0_S 0
#define AM_REG_INFOC_LOCKMASK0_OTP_DCU_LOCK_MASK0_M 0xFFFFFFFF
#define AM_REG_INFOC_LOCKMASK0_OTP_DCU_LOCK_MASK0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_LOCKMASK0_OTP_DCU_LOCK_MASK0_Pos 0
#define AM_REG_INFOC_LOCKMASK0_OTP_DCU_LOCK_MASK0_Msk 0xFFFFFFFF

// LOCKMASK1 - OTP DCU lock mask
#define AM_REG_INFOC_LOCKMASK1_OTP_DCU_LOCK_MASK1_S 0
#define AM_REG_INFOC_LOCKMASK1_OTP_DCU_LOCK_MASK1_M 0xFFFFFFFF
#define AM_REG_INFOC_LOCKMASK1_OTP_DCU_LOCK_MASK1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_LOCKMASK1_OTP_DCU_LOCK_MASK1_Pos 0
#define AM_REG_INFOC_LOCKMASK1_OTP_DCU_LOCK_MASK1_Msk 0xFFFFFFFF

// LOCKMASK2 - OTP DCU lock mask
#define AM_REG_INFOC_LOCKMASK2_OTP_DCU_LOCK_MASK2_S 0
#define AM_REG_INFOC_LOCKMASK2_OTP_DCU_LOCK_MASK2_M 0xFFFFFFFF
#define AM_REG_INFOC_LOCKMASK2_OTP_DCU_LOCK_MASK2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_LOCKMASK2_OTP_DCU_LOCK_MASK2_Pos 0
#define AM_REG_INFOC_LOCKMASK2_OTP_DCU_LOCK_MASK2_Msk 0xFFFFFFFF

// LOCKMASK3 - OTP DCU lock mask
#define AM_REG_INFOC_LOCKMASK3_OTP_DCU_LOCK_MASK3_S 0
#define AM_REG_INFOC_LOCKMASK3_OTP_DCU_LOCK_MASK3_M 0xFFFFFFFF
#define AM_REG_INFOC_LOCKMASK3_OTP_DCU_LOCK_MASK3(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_LOCKMASK3_OTP_DCU_LOCK_MASK3_Pos 0
#define AM_REG_INFOC_LOCKMASK3_OTP_DCU_LOCK_MASK3_Msk 0xFFFFFFFF

// SBL_WPROT0 - These bits write-protect NVRAM in 16KB chunks. Only SBL can override these through Secure OTA.
#define AM_REG_INFOC_SBL_WPROT0_CHUNKS_S 0
#define AM_REG_INFOC_SBL_WPROT0_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFOC_SBL_WPROT0_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_SBL_WPROT0_CHUNKS_Pos 0
#define AM_REG_INFOC_SBL_WPROT0_CHUNKS_Msk 0xFFFFFFFF

// SBL_WPROT1 - These bits write-protect NVRAM in 16KB chunks. Only SBL can override these through Secure OTA.
#define AM_REG_INFOC_SBL_WPROT1_CHUNKS_S 0
#define AM_REG_INFOC_SBL_WPROT1_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFOC_SBL_WPROT1_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_SBL_WPROT1_CHUNKS_Pos 0
#define AM_REG_INFOC_SBL_WPROT1_CHUNKS_Msk 0xFFFFFFFF

// SBL_WPROT2 - These bits write-protect NVRAM in 16KB chunks. Only SBL can override these through Secure OTA.
#define AM_REG_INFOC_SBL_WPROT2_CHUNKS_S 0
#define AM_REG_INFOC_SBL_WPROT2_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFOC_SBL_WPROT2_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_SBL_WPROT2_CHUNKS_Pos 0
#define AM_REG_INFOC_SBL_WPROT2_CHUNKS_Msk 0xFFFFFFFF

// SBL_WPROT3 - These bits write-protect NVRAM in 16KB chunks. Only SBL can override these through Secure OTA.
#define AM_REG_INFOC_SBL_WPROT3_CHUNKS_S 0
#define AM_REG_INFOC_SBL_WPROT3_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFOC_SBL_WPROT3_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_SBL_WPROT3_CHUNKS_Pos 0
#define AM_REG_INFOC_SBL_WPROT3_CHUNKS_Msk 0xFFFFFFFF

// SBL_WPROT4 - These bits write-protect NVRAM in 16KB chunks. Only SBL can override these through Secure OTA.
#define AM_REG_INFOC_SBL_WPROT4_CHUNKS_S 0
#define AM_REG_INFOC_SBL_WPROT4_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFOC_SBL_WPROT4_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_SBL_WPROT4_CHUNKS_Pos 0
#define AM_REG_INFOC_SBL_WPROT4_CHUNKS_Msk 0xFFFFFFFF

// SBL_WPROT5 - These bits write-protect NVRAM in 16KB chunks. Only SBL can override these through Secure OTA.
#define AM_REG_INFOC_SBL_WPROT5_CHUNKS_S 0
#define AM_REG_INFOC_SBL_WPROT5_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFOC_SBL_WPROT5_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_SBL_WPROT5_CHUNKS_Pos 0
#define AM_REG_INFOC_SBL_WPROT5_CHUNKS_Msk 0xFFFFFFFF

// SBL_WPROT6 - These bits write-protect NVRAM in 16KB chunks. Only SBL can override these through Secure OTA.
#define AM_REG_INFOC_SBL_WPROT6_CHUNKS_S 0
#define AM_REG_INFOC_SBL_WPROT6_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFOC_SBL_WPROT6_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_SBL_WPROT6_CHUNKS_Pos 0
#define AM_REG_INFOC_SBL_WPROT6_CHUNKS_Msk 0xFFFFFFFF

// SBL_WPROT7 - These bits write-protect NVRAM in 16KB chunks. Only SBL can override these through Secure OTA.
#define AM_REG_INFOC_SBL_WPROT7_CHUNKS_S 0
#define AM_REG_INFOC_SBL_WPROT7_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFOC_SBL_WPROT7_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_SBL_WPROT7_CHUNKS_Pos 0
#define AM_REG_INFOC_SBL_WPROT7_CHUNKS_Msk 0xFFFFFFFF

// SBL_RPROT0 - These bits read-protect NVRAM in 16KB chunks.
#define AM_REG_INFOC_SBL_RPROT0_CHUNKS_S 0
#define AM_REG_INFOC_SBL_RPROT0_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFOC_SBL_RPROT0_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_SBL_RPROT0_CHUNKS_Pos 0
#define AM_REG_INFOC_SBL_RPROT0_CHUNKS_Msk 0xFFFFFFFF

// SBL_RPROT1 - These bits read-protect NVRAM in 16KB chunks. Only SBL can override these through Secure OTA.
#define AM_REG_INFOC_SBL_RPROT1_CHUNKS_S 0
#define AM_REG_INFOC_SBL_RPROT1_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFOC_SBL_RPROT1_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_SBL_RPROT1_CHUNKS_Pos 0
#define AM_REG_INFOC_SBL_RPROT1_CHUNKS_Msk 0xFFFFFFFF

// SBL_RPROT2 - These bits read-protect NVRAM in 16KB chunks. Only SBL can override these through Secure OTA.
#define AM_REG_INFOC_SBL_RPROT2_CHUNKS_S 0
#define AM_REG_INFOC_SBL_RPROT2_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFOC_SBL_RPROT2_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_SBL_RPROT2_CHUNKS_Pos 0
#define AM_REG_INFOC_SBL_RPROT2_CHUNKS_Msk 0xFFFFFFFF

// SBL_RPROT3 - These bits read-protect NVRAM in 16KB chunks. Only SBL can override these through Secure OTA.
#define AM_REG_INFOC_SBL_RPROT3_CHUNKS_S 0
#define AM_REG_INFOC_SBL_RPROT3_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFOC_SBL_RPROT3_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_SBL_RPROT3_CHUNKS_Pos 0
#define AM_REG_INFOC_SBL_RPROT3_CHUNKS_Msk 0xFFFFFFFF

// SBL_RPROT4 - These bits read-protect NVRAM in 16KB chunks. Only SBL can override these through Secure OTA.
#define AM_REG_INFOC_SBL_RPROT4_CHUNKS_S 0
#define AM_REG_INFOC_SBL_RPROT4_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFOC_SBL_RPROT4_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_SBL_RPROT4_CHUNKS_Pos 0
#define AM_REG_INFOC_SBL_RPROT4_CHUNKS_Msk 0xFFFFFFFF

// SBL_RPROT5 - These bits read-protect NVRAM in 16KB chunks. Only SBL can override these through Secure OTA.
#define AM_REG_INFOC_SBL_RPROT5_CHUNKS_S 0
#define AM_REG_INFOC_SBL_RPROT5_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFOC_SBL_RPROT5_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_SBL_RPROT5_CHUNKS_Pos 0
#define AM_REG_INFOC_SBL_RPROT5_CHUNKS_Msk 0xFFFFFFFF

// SBL_RPROT6 - These bits read-protect NVRAM in 16KB chunks. Only SBL can override these through Secure OTA.
#define AM_REG_INFOC_SBL_RPROT6_CHUNKS_S 0
#define AM_REG_INFOC_SBL_RPROT6_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFOC_SBL_RPROT6_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_SBL_RPROT6_CHUNKS_Pos 0
#define AM_REG_INFOC_SBL_RPROT6_CHUNKS_Msk 0xFFFFFFFF

