AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo5a/regs/am_mcu_apollo5a_mraminfoc.h
// KEYBANK_CUST_QUADRANT3_KEY6 - Customer key bank
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY6_KEY_S 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY6_KEY_M 0xFFFFFFFF
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY6_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY6_KEY_Pos 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY6_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY7 - Customer key bank
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY7_KEY_S 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY7_KEY_M 0xFFFFFFFF
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY7_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY7_KEY_Pos 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY7_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY8 - Customer key bank
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY8_KEY_S 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY8_KEY_M 0xFFFFFFFF
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY8_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY8_KEY_Pos 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY8_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY9 - Customer key bank
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY9_KEY_S 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY9_KEY_M 0xFFFFFFFF
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY9_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY9_KEY_Pos 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY9_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY10 - Customer key bank
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY10_KEY_S 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY10_KEY_M 0xFFFFFFFF
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY10_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY10_KEY_Pos 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY10_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY11 - Customer key bank
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY11_KEY_S 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY11_KEY_M 0xFFFFFFFF
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY11_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY11_KEY_Pos 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY11_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY12 - Customer key bank
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY12_KEY_S 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY12_KEY_M 0xFFFFFFFF
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY12_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY12_KEY_Pos 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY12_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY13 - Customer key bank
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY13_KEY_S 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY13_KEY_M 0xFFFFFFFF
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY13_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY13_KEY_Pos 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY13_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY14 - Customer key bank
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY14_KEY_S 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY14_KEY_M 0xFFFFFFFF
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY14_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY14_KEY_Pos 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY14_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT3_KEY15 - Customer key bank
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY15_KEY_S 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY15_KEY_M 0xFFFFFFFF
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY15_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY15_KEY_Pos 0
#define AM_REG_INFOC_KEYBANK_CUST_QUADRANT3_KEY15_KEY_Msk 0xFFFFFFFF

#endif
